base/DataProcessors/бит_ОбработкаЗаписейРегистраОчередьТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ОбработкаЗаписейРегистраОчередьТрансляции</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийОбработкиОчередиТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыВыполненияОтложеннойТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Comment>Компоновщик</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/DataProcessors/бит_ОбработкаЗаписейРегистраОчередьТрансляции/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);	
	Если фОтказ Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним вид операции.
	Если Параметры.Свойство("ВидОперации") Тогда	
		Объект.ВидОперации = Параметры.ВидОперации;		
	КонецЕсли; 	
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда	
		Объект.ВидОперации = Перечисления.бит_ВидыОперацийОбработкиОчередиТрансляции.УдалитьОбработанныеЗаписи;	
	КонецЕсли; 
	
	ВидОперацииИзменитьСтатус = Перечисления.бит_ВидыОперацийОбработкиОчередиТрансляции.ИзменитьСтатус;
	
	// Инициализируем настройки компоновщика.
	АдресСхемыКомпоновкиДанных = Обработки.бит_ОбработкаЗаписейРегистраОчередьТрансляции.ИнициализироватьКомпоновщик(Объект.Компоновщик,УникальныйИдентификатор);
	Обработки.бит_ОбработкаЗаписейРегистраОчередьТрансляции.УстановитьОтборыКомпоновщика(Объект.Компоновщик,Объект.ВидОперации);		
	
	Элементы.КомпоновщикПользовательскиеНастройки.РежимОтображения = РежимОтображенияНастроекКомпоновкиДанных.БыстрыйДоступ;	
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ИзменениеВидаОперации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	// Проверим заполнение обязательных реквизитов.
	флНетОшибок = ПроверитьЗаполнение();
	
	Если Объект.ВидОперации = ВидОперацииИзменитьСтатус И НЕ ЗначениеЗаполнено(Объект.Статус) Тогда	
		ТекстСообщения = НСтр("ru='Поле ""Статус"" не заполнено.';en='The ""Status"" is not filled.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,Объект,"Объект.Статус");
		флНетОшибок = Ложь;		
	КонецЕсли;	
	
	Если флНетОшибок Тогда		
		// Выполним требуемые действия.
		ОбработатьЗаписиРегистраОчередьТрансляции();
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.бит_ОчередьТрансляции"));
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет действия с записями регистра сведений бит_ОчередьТрансляции.
// 
// 
&НаСервере
Процедура ОбработатьЗаписиРегистраОчередьТрансляции()
	
	Результат = Обработки.бит_ОбработкаЗаписейРегистраОчередьТрансляции.ВыполнитьЗапросПоНастройке(Объект.Компоновщик
	                                                                                              ,АдресСхемыКомпоновкиДанных);
																							   
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийОбработкиОчередиТрансляции.УдалитьОбработанныеЗаписи Тогда
		
		Обработки.бит_ОбработкаЗаписейРегистраОчередьТрансляции.УдалитьОбработанныеЗаписи(Результат,"Все");
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийОбработкиОчередиТрансляции.ИзменитьСтатус Тогда	
		
		Обработки.бит_ОбработкаЗаписейРегистраОчередьТрансляции.ИзменитьСтатусОповещений(Результат,Объект.Статус,"Все");		
		
	КонецЕсли; 																						   
	
КонецПроцедуры // ОбработатьЗаписиРегистраОповещений()

// Процедура обрабатывает изменение вида операции.
// 
&НаСервере
Процедура ИзменениеВидаОперации()

	Обработки.бит_ОбработкаЗаписейРегистраОчередьТрансляции.УстановитьОтборыКомпоновщика(Объект.Компоновщик,Объект.ВидОперации);	
	
	УстановитьВидимость();
	
КонецПроцедуры // ИзменениеВидаОперации()

// Процедура устанавливает видимость/доступность элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()

	ЭтоИзменениеСтатуса = ?(Объект.ВидОперации = Перечисления.бит_ВидыОперацийОбработкиОчередиТрансляции.ИзменитьСтатус,Истина,Ложь);
	
	Элементы.Статус.Видимость = ЭтоИзменениеСтатуса;

КонецПроцедуры // УстановитьВидимость()

#КонецОбласти
